# Day1~8

## 자바

자바 특징

* 운영체제 독립적(but JRE필요)
* 객체지향언어
* 자동 메모리 관리(가비지컬렉터)가 자동적으로 관리
* 네트워크라 분산처리 지원
* 멀티쓰레드 지원
* 동적 로딩 지원

JVM

- JRE에 포함되어 있는 '자바 실행 위한  가상기계'

자바개발환경

- javac.exe 자바 컴파일러(자바소스코드를 바이트코드로 컴파일)
- java.exe 자바 인터프리터 해석&실행
- javadoc.exe 문서 자동생성
- jar.exe 압축프로그램

주석

- /* */ 범위주석
- // 한줄주석

변수

- 단 하나의 값을 저장할 수 있는 메모리 공간
- 자바 변수 선언or 실행 문장 한개라도 반드시 클래스 단위로 소스코드 작성
- 키워드는 식별자(변수,메소드,클래스)로 사용 못한다.

기본형

|        | 1byte  | 2byte | 4byte | 8byte  |
| ------ | ------ | ----- | ----- | ------ |
| 논리형 | boolen |       |       |        |
| 문자형 |        | char  |       |        |
| 정수형 | byte   | short | int   | long   |
| 실수형 |        |       | float | double |

- casting은 byte short (char) int long float double 순서이다. char의 경우  

